{"last_update":1546719976,"list":[{"id":"a6665d35264241f42a7a4aba82e9bec8e5bb375b","count":2127,"details":{"status":true,"published":true,"likes":6,"views":"2.1K","comments":2,"article_fb":"http:\/\/www.facebook.com\/sharer.php?u=http:\/\/[::1]\/talk_new\/article\/is-dcj-philomena-mwilu’s-arrest-a-stab-on-the-‘handshake’~9b73c?p='fb'","article_twitter":"http:\/\/twitter.com\/intent\/tweet?url=http:\/\/[::1]\/talk_new\/article\/is-dcj-philomena-mwilu’s-arrest-a-stab-on-the-‘handshake’~9b73c?p='twitter'&text=Is DCJ Philomena Mwilu’s Arrest A Stab on the ‘Handshake’?","article_linked":"https:\/\/www.linkedin.com\/cws\/share?url=http:\/\/[::1]\/talk_new\/article\/is-dcj-philomena-mwilu’s-arrest-a-stab-on-the-‘handshake’~9b73c?p='linked'&text=Is DCJ Philomena Mwilu’s Arrest A Stab on the ‘Handshake’?","owner":false,"user_following":true,"user_liked":true,"isOnline":true,"details":{"identifier":"a6665d35264241f42a7a4aba82e9bec8e5bb375b","column":"Politics & Leadership","url":"http:\/\/[::1]\/talk_new\/article\/is-dcj-philomena-mwilu’s-arrest-a-stab-on-the-‘handshake’~9b73c","title":"Is DCJ Philomena Mwilu’s Arrest A Stab on the ‘Handshake’?","attachment":{"type":"image","meta":"","src":"http:\/\/[::1]\/talk_new\/uploads\/posts\/906ee479c5dae0a95006e9e282a8f81b.JPG"},"content":"<p>The recent arrest of Deputy Chief Justice Philomena Mwilu has stirred conflicting emotions in the country. The DCJ was arrested for a number of alleged criminal offences including abuse of office, tax evasion and involvement in the fall of Imperial Bank.&nbsp;<\/p><p>The case has since sent tongues wagging, with different people viewing it as a stab on the heart of the much-popularized handshake between President Uhuru Kenyatta and opposition kingpin Raila Odinga.<\/p><p><strong>Divided along opinion lines<\/strong>&nbsp;<\/p><p>People are at odds over the arrest of the DCJ. On the one side are those who are commending the Director of Public Prosecutions, DPP Noordin Hajji for his efforts towards eradicating corruption &ndash; or what seems like it. To them, he is a symbol of hope that somehow this lethal disease (corruption) that has been eating the country for so long can be dealt with. On the other, sits a group of Philomena Mwilu sympathizers who feel that this arrest was politically instigated.<\/p><p>Just hours after DCJ Mwilu was arrested at Supreme Court in Nairobi, Lawyer James Orengo was quick to argue that the move was driven by &apos;other factors&apos;. &nbsp;Even Wiper party leader Kalonzo Musyoka, who has not practiced law in decades, has since joined the legal fight for the DCJ. &nbsp;<\/p><p><strong>Targeting specific individuals<\/strong><\/p><p>In the past weeks, Deputy President William Ruto has been heard on many occasions complaining that the fight against corruption is politicized and aimed at targeting specific individuals. But Kenyans were fast to attack and call him names. As it is, a portion of the populace seems to now buy into his sentiments.&nbsp;<\/p><p>ODM Party also cast their doubts on the way this arrest was carried out, and was heard through a statement by their chairman John Mbadi, saying that this could be a possible &apos;political arrest&apos;.&nbsp;<\/p><p><strong>Not any ordinary case<\/strong>&nbsp;<\/p><p>Looking at how the past arrests on cases touching on judicial officers such as Justice Tunoi and Former Deputy Chief Justice Nancy Baraza were conducted, it can clearly be deduced that this arrest was not ordinary. A witch hunt to be precise. For example, the two cases were processed through the Judicial Service Commission, JSC, an option that was not presented here. Any sitting judges&apos; conduct is usually investigated by JSC which in turn recommends a tribunal.<\/p><p>Attempting to wash hands off the &apos;politically instigated&apos; opinion, a jubilee politician said the President had earlier on, before heading to the US, asked the Office of the DPP to take its time in handling the case. They said that DCJ Mwilu&apos;s case was among the 500 dossiers that had been handed to the president.<\/p><p><strong>Putting it all together&hellip;<\/strong><\/p><p>Going back to when the August 8 General Elections were nullified, the President went on record swearing, \"we will revisit\", a jibe that was directed to the judiciary.&nbsp;<\/p><p>Kenyans are yet to forget these remarks. And right about now, looking at how the arrest was handled, one could argue that the &apos;revisit&apos; time has just begun. &nbsp;<\/p><p>Well, some analysts are arguing that the timing of the arrest can be termed as bad considering how charged the country is. And this case could make or see to the dust, the good work that the DPP&apos;s office has put forward before in attempting to fight corruption.<\/p><p>Whether any of this is the correct position remains to be seen. Let us sit back and wait to see how things unfold.&nbsp;<\/p>","content_min":"<p>The recent arrest of Deputy Chief Justice Philomena Mwilu has stirred conflicting emotions in the country. The DCJ was arrested for a number of alleged criminal offences including abuse of office, tax evasion and involvement in the fall of Imperial Bank.&nbsp;<\/p><p>The case has since sent tongue","author":"@angelyneobonyo","usr_id":"149","author_clean":"angelyneobonyo","author_name":"Angelyne Obonyo","author_img":"http:\/\/[::1]\/talk_new\/uploads\/profile\/21f8615cdbfd5889f3075cc632866166.jpg","type":"normal","published":"1535695830","date":"31-08-2018"}},"formatted":"2.1K","position":"#1"},{"id":"2d2ad9152da29d156b2195ab1d9ae137018634b6","count":1162,"details":{"status":true,"published":true,"likes":3,"views":"1.2K","comments":0,"article_fb":"http:\/\/www.facebook.com\/sharer.php?u=http:\/\/[::1]\/talk_new\/article\/banished-teenage-lion-the-journey-of-the-first-time-entrepreneur~9b73c?p='fb'","article_twitter":"http:\/\/twitter.com\/intent\/tweet?url=http:\/\/[::1]\/talk_new\/article\/banished-teenage-lion-the-journey-of-the-first-time-entrepreneur~9b73c?p='twitter'&text=Banished teenage lion! The journey of the first time entrepreneur.","article_linked":"https:\/\/www.linkedin.com\/cws\/share?url=http:\/\/[::1]\/talk_new\/article\/banished-teenage-lion-the-journey-of-the-first-time-entrepreneur~9b73c?p='linked'&text=Banished teenage lion! The journey of the first time entrepreneur.","owner":false,"user_following":true,"user_liked":false,"isOnline":true,"details":{"identifier":"2d2ad9152da29d156b2195ab1d9ae137018634b6","column":"Money & Business","url":"http:\/\/[::1]\/talk_new\/article\/banished-teenage-lion-the-journey-of-the-first-time-entrepreneur~9b73c","title":"Banished teenage lion! The journey of the first time entrepreneur.","attachment":{"type":"image","meta":"","src":"http:\/\/[::1]\/talk_new\/uploads\/posts\/0f34de34e675d790a8fb70f9a0beaa32.jpg"},"content":"<p>There comes a time in the life of a young person when he has outgrown his current set of circumstances and is yearning for more. He wants more money, more fulfilment more appreciation, more voice&hellip;just more.<\/p><p>He has worked diligently for people and organisations, he has built a &apos;small&apos; name for himself, but it is not enough anymore. He doesn&apos;t draw anymore fulfilment from his daily duties. Internally, he feels he has the capacity to be more, do more and have more. He is convinced that he has come of age and that he deserves what he desires. One thing is the problem though, the set of circumstances cannot allow him to experience anything more than he already has. He finds himself in the exact unfortunate situation the teenage lions find themselves moments before they are banished from the pride.<\/p><p>It comes without notice, but suddenly, you have jumped out of your comfort, convinced that you have what it takes to make it in the unpredictable business world; you have no idea what the hell awaits you!<\/p><p>Just like the young lion, you will very quickly find yourself disoriented, weak and vulnerable. Everything is nothing like what they promised to be. You have no brand as business, no track record, no business experince, no clients and absolutely zero cash flow. Your reserves are quickly depleting, your first hires are absolute disasters and if you make the &apos;smart&apos; move to find a partner, you are either swindled, taken advantage of or just plain disappointed.<\/p><p>Like the lion, the child of privilege, you suddenly find yourself literally scavenging! You no longer remember what the big dream was. You left employment and there is no going back because you were very loud about your new title as the CEO of the most promising company south of Sahara.<\/p><p>You are like a fighter in the heavy weight championships, you have given everything but the adversary keeps coming. You are being hit left, right centre, literally from every angle. At this point in time there is only one thing in your mind: Will I survive this? And many do not survive!<\/p><p>When you look at the statistics on start-ups in this country, and you see that 99% of new businesses fail within the first three years of operation; By the way, how did you imagine the founders experienced that failure? Do you think they were less smart than you? Or they didn&apos;t have the winning strategies like the one you hold in your head?<\/p><p>Look here, when you start out, it is going to be brutal, yes, very harsh for a while.<\/p><p>However, if at the time when it all looked like a lost cause, at the moment when you were lying flat on your back, after shutting down your premises and sworn never to do this again, if at that specific moment you find some little strength to try again and decide to take whatever more this adversary might bring then welcome to the 1% who make it!<\/p><p>I have been building a business from the ground up for a few years now and I have studied a lot of people who have done similar things, the unfortunate realisation is that there are but no exceptions to this journey!<\/p><p>Before a lion becomes king, he will be banished, he will have to survive alone for long, then he will have to come back and overthrow a reigning king, only then does he become king.<\/p><p>The entrepreneur&apos;s emotional and psychological journey is exactly the same!<\/p><p>Bonne chance.<\/p>","content_min":"<p>There comes a time in the life of a young person when he has outgrown his current set of circumstances and is yearning for more. He wants more money, more fulfilment more appreciation, more voice&hellip;just more.<\/p><p>He has worked diligently for people and organisations, he has built a &apos;s","author":"@kelvinagengo","usr_id":"77","author_clean":"kelvinagengo","author_name":"Kelvin Agengo","author_img":"http:\/\/[::1]\/talk_new\/uploads\/profile\/8f73a7b22b3a6992da3fe3383ee03b66.jpg","type":"normal","published":"1532591008","date":"26-07-2018"}},"formatted":"1.2K","position":"#2"},{"id":"758b6ae7dbf1e2dbfbea797f154353cd80a08f6c","count":1014,"details":{"status":true,"published":true,"likes":4,"views":"1.0K","comments":2,"article_fb":"http:\/\/www.facebook.com\/sharer.php?u=http:\/\/[::1]\/talk_new\/article\/when-it-comes-to-business-theres-no-giving-your-best-but-your-all---a-personal-story~9b73c?p='fb'","article_twitter":"http:\/\/twitter.com\/intent\/tweet?url=http:\/\/[::1]\/talk_new\/article\/when-it-comes-to-business-theres-no-giving-your-best-but-your-all---a-personal-story~9b73c?p='twitter'&text=When It Comes to Business, There's No Giving Your Best, but Your ALL - A Personal Story","article_linked":"https:\/\/www.linkedin.com\/cws\/share?url=http:\/\/[::1]\/talk_new\/article\/when-it-comes-to-business-theres-no-giving-your-best-but-your-all---a-personal-story~9b73c?p='linked'&text=When It Comes to Business, There's No Giving Your Best, but Your ALL - A Personal Story","owner":false,"user_following":true,"user_liked":false,"isOnline":true,"details":{"identifier":"758b6ae7dbf1e2dbfbea797f154353cd80a08f6c","column":"Money & Business","url":"http:\/\/[::1]\/talk_new\/article\/when-it-comes-to-business-theres-no-giving-your-best-but-your-all---a-personal-story~9b73c","title":"When It Comes to Business, There's No Giving Your Best, but Your ALL - A Personal Story","attachment":{"type":"image","meta":"","src":"http:\/\/[::1]\/talk_new\/uploads\/posts\/32d4683dbbf9beca715a8b9a96594083.jpg"},"content":"<p>The year is 2015. In my mind, I have overcome some of the greatest tests that life can ever bring into any young man&apos;s life.<\/p><p>My personal life, had in many ways been a lot of mess before then and I had worked myself out of some very deep and dark holes. I had fallen hard and risen up time and again in the decade preceding that year. I was feeling quite pleased with my personal development.<\/p><p>The workplace became narrower by the day, opportunities for growth seemed to diminish fast. I thought to myself: Kelvin, you have always wanted to be an entrepreneur, maybe this is the signal you have been waiting for.<\/p><p>The internal argument was short and decisive. I was going to resign from work (there was nothing new about that, I had resigned before anyway) and I was going to become the greatest this side of the Sahara.<\/p><p>Three years on, and this is how it has been: HARD WORK!<\/p><p><strong>Let me share a little bit;<\/strong><\/p><p>When I started out I believed firmly that most people failed in business because they were not smart enough to figure out what they needed to get past in order to succeed. I believed I was smart, and as such, to succeed was going to be a walk in the park or something in that neighbourhood.<\/p><p>Things started to move with the speed that I expected, and then one day (it felt like one day); one day I wake up and I am broke, and in debt. I&apos;m tired, disgruntled, stuck and absolutely confused! I was lost, so lost I didn&apos;t even recognise myself anymore. This entrepreneurship thing had turned me into I-don&apos;t-know-exactly-what!<\/p><p>I had no peers because most, if not all of my friends were enjoying their fat salaries and the few who claimed to be in business, were either having it as a &apos;side hustle&apos; or had been there too long&hellip; I just couldn&apos;t relate.<\/p><p>My options&hellip;well I didn&apos;t have options. I was either going to quit and go back to job-hunting or die trying to make this work. Part of my family was very sceptical and with all the good intentions, they advised me to find employment. They reminded me how colourful my CV was and how, with my connections, it wouldn&apos;t take me even a week to break through.<\/p><p>They were right in the latter.<\/p><p>One fateful morning, when I was without lunch money, I saw that a friend of mine had posted some opportunity with a Chinese company. I called, the hook-up was quick, I got the job! A fat salary, a much bigger car than my then Lancer. I reported to work. &nbsp;<\/p><p>My first day there was the worst day of my life!<\/p><p>Here I was, convinced that I had given my best to business and that my best efforts had turned up NIL! I had failed. Then, I am sitting in this huge office going to help some Chinese build a business in an environment that is my home in an industry that is my forte &ndash; No way! I left in the evening of day two and never returned!<\/p><p><strong>Long story short,<\/strong><\/p><p>Some time has passed since that pivotal incident and this is what I took away from it; this is what has built me and what will build many more entrepreneurs:<\/p><p>In business, there is no such thing as your best. You give your all every day. And when you feel like you have really given your all, you take a deep breath and then give some more&hellip; every day until the Father himself says: You have done your part, now it is my turn to return the favour!<\/p><p><strong>Give your all. Always. Not just your best! <\/strong><\/p>","content_min":"<p>The year is 2015. In my mind, I have overcome some of the greatest tests that life can ever bring into any young man&apos;s life.<\/p><p>My personal life, had in many ways been a lot of mess before then and I had worked myself out of some very deep and dark holes. I had fallen hard and risen up ti","author":"@kelvinagengo","usr_id":"77","author_clean":"kelvinagengo","author_name":"Kelvin Agengo","author_img":"http:\/\/[::1]\/talk_new\/uploads\/profile\/8f73a7b22b3a6992da3fe3383ee03b66.jpg","type":"normal","published":"1535011152","date":"23-08-2018"}},"formatted":"1.0K","position":"#3"},{"id":"68fd640501786aebe7c2f6f0b9230da72dbbe4be","count":853,"details":{"status":true,"published":true,"likes":4,"views":853,"comments":1,"article_fb":"http:\/\/www.facebook.com\/sharer.php?u=http:\/\/[::1]\/talk_new\/article\/we-africans-have-a-heart-for-funerals-but-what’s-the-essence~9b73c?p='fb'","article_twitter":"http:\/\/twitter.com\/intent\/tweet?url=http:\/\/[::1]\/talk_new\/article\/we-africans-have-a-heart-for-funerals-but-what’s-the-essence~9b73c?p='twitter'&text=We Africans Have A Heart for Funerals, But What’s the Essence?","article_linked":"https:\/\/www.linkedin.com\/cws\/share?url=http:\/\/[::1]\/talk_new\/article\/we-africans-have-a-heart-for-funerals-but-what’s-the-essence~9b73c?p='linked'&text=We Africans Have A Heart for Funerals, But What’s the Essence?","owner":false,"user_following":true,"user_liked":true,"isOnline":true,"details":{"identifier":"68fd640501786aebe7c2f6f0b9230da72dbbe4be","column":"Life & Style","url":"http:\/\/[::1]\/talk_new\/article\/we-africans-have-a-heart-for-funerals-but-what’s-the-essence~9b73c","title":"We Africans Have A Heart for Funerals, But What’s the Essence?","attachment":{"type":"image","meta":"","src":"http:\/\/[::1]\/talk_new\/uploads\/posts\/28fdff01a6a3fc0b2d9bd3d59097fe5f.PNG"},"content":"<p>Isn&apos;t it ridiculous how we languish in poverty yet spend lots and lots of cash on funeral arrangements when our friends and relatives pass on? Where is the essence of showing all that attention and concern only after we have lost the life? What is in the death of our people that inspire so much in us to give them pompous sendoff while sometimes they died forlorn, desperate or even lacking friends to show them care and love?<\/p><p>We tend to not bother to turn our heads when these people call for our attention. We bring them no food when they are hungry. We create no time to go and laugh with them, but we cry gingerly when they eventually pass away. Isn&apos;t that hypocrisy at its best?<\/p><p><strong>Funeral WhatsApp groups, the most abused service <\/strong><\/p><p>Recently, while I was scrolling down my WhatsApp messages, I was perplexed to find myself in a WhatsApp group for a funeral arrangement. Nobody had asked to add me there, but there I was nonetheless.<\/p><p>Of late I have been suffering, I always find myself added to various WhatsApp groups where there is need for serious financial contribution. I don&apos;t know whether it&apos;s because I finished campus and I&apos;m expected to start giving back to the society or what. If it is not a wedding then it&apos;s some project that someone is starting somewhere. Or, sometimes, someone wants to be bailed out in some way. But mostly, it&apos;s often a wedding.<\/p><p>Notably, while WhatsApp has brought us this option of groups; a great service indeed, people are taking it too far &ndash; invading others&apos; privacy without warning. You just pick a guy and add him to a group, and you don&apos;t explain a thing.<\/p><p>I don&apos;t have a problem contributing, but manners! Friends, manners! Explain to me first, then allow me to decide if I can help you or not. You can&apos;t always be snubbing me; no greetings, but when you hit the ground, you squeeze me into your WhatsApp groups.<\/p><p>Apparently, this friend of mine had lost the father who had been ailing for way too long but I didn&apos;t know about it. A message about his sickness didn&apos;t reach me but when he died, I had to know about it.<\/p><p>The group wasn&apos;t meant to bring us together and cry but it was supposed to raise funds for funeral arrangements. The aggregated cost was about 800,000 shillings just to take the old man six feet below the ground. People contributed generously.<\/p><p>I didn&apos;t know whether a WhatsApp group had been created earlier to raise funds to offset a hospital bill or to help the man get health care. I don&apos;t know. But I&apos;m sure it wasn&apos;t there because I would have been added there.<\/p><p>Why spend close to a million Kenya shillings on a funeral?<\/p><p><strong>Why waste too much?<\/strong><\/p><p>Do we really have a reason for spending so much on funerals? Why plunder resources on a dead person? Aren&apos;t we Africans still hanging on the old popular but baseless belief that dead people bless the living? That we must give them a &apos;dignified&apos; burial in order to get their blessings? If they bless us, why do they leave us here in a miserable life? Why do we cry when they go to the other side to bless us?<\/p><p>Look, get a simple but decent coffin and put in the peaceful corpse; plunge him or her into the ground. This should take barely four hours to accomplish. Then we can condole with the family by offering some cash to help in various ways.<\/p><p>The business of going to pour money on someone&apos;s funeral is outdated and regressive. Muslims bury their dead immediately in a simple ceremony, and we aren&apos;t any better than them.<\/p><p><strong>Let&apos;s spend on the living, not the dead! <\/strong><\/p><p>Let&apos;s help people stop dying prematurely by caring for them, help them out while they live. And in the unfortunate event of death, very little should be spent on the funeral.<\/p><p>Let&apos;s celebrate life not death by communing with one another while alive. Personally, I&apos;ll be willing and happy to help with medical bills rather than raise funds for funeral arrangements. Because whichever way you look at it, it&apos;s more prudent to help preserve life than wait to celebrate the loss of it. &nbsp;<\/p>","content_min":"<p>Isn&apos;t it ridiculous how we languish in poverty yet spend lots and lots of cash on funeral arrangements when our friends and relatives pass on? Where is the essence of showing all that attention and concern only after we have lost the life? What is in the death of our people that inspire so m","author":"@leonardondigo","usr_id":"140","author_clean":"leonardondigo","author_name":"Leonard Ondigo","author_img":"http:\/\/[::1]\/talk_new\/uploads\/profile\/a5e083ae0a10334ca476a6bd52f16f30.jpg","type":"normal","published":"1542004164","date":"12-11-2018"}},"formatted":853,"position":"#4"},{"id":"58e56c36400eaaab4aec87dc7e080d31c565f3de","count":754,"details":{"status":true,"published":true,"likes":3,"views":754,"comments":0,"article_fb":"http:\/\/www.facebook.com\/sharer.php?u=http:\/\/[::1]\/talk_new\/article\/abolish-the-national-assembly-lets-work-with-the-senate~9b73c?p='fb'","article_twitter":"http:\/\/twitter.com\/intent\/tweet?url=http:\/\/[::1]\/talk_new\/article\/abolish-the-national-assembly-lets-work-with-the-senate~9b73c?p='twitter'&text=Abolish the National Assembly, Let's Work with The Senate","article_linked":"https:\/\/www.linkedin.com\/cws\/share?url=http:\/\/[::1]\/talk_new\/article\/abolish-the-national-assembly-lets-work-with-the-senate~9b73c?p='linked'&text=Abolish the National Assembly, Let's Work with The Senate","owner":false,"user_following":true,"user_liked":false,"isOnline":true,"details":{"identifier":"58e56c36400eaaab4aec87dc7e080d31c565f3de","column":"Politics & Leadership","url":"http:\/\/[::1]\/talk_new\/article\/abolish-the-national-assembly-lets-work-with-the-senate~9b73c","title":"Abolish the National Assembly, Let's Work with The Senate","attachment":{"type":"image","meta":"","src":"http:\/\/[::1]\/talk_new\/uploads\/posts\/20e254f326804a70b0b2f1ab6e17558a.jpg"},"content":"<p>Much has been said about the Government wage bill, bloated National Assembly and the unsustainable recurrent expenditure budget.<\/p><p>I don&apos;t engage in politics a lot these days, so I will try not to turn political here and just say what is in my mind.<\/p><p>What if we just worked with the Senate alone &ndash; as in abolish The National Assembly?<\/p><p>The National Assembly has only three key roles; this we all know:<\/p><p>1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Legislation: basically, coming up with laws that govern the country.<\/p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Controlling the country&apos;s finances.<\/p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Oversight on the government (checking the actions of the government).<\/p><p><strong>My thoughts:<\/strong><\/p><p>The function of legislation, and indeed all the functions of the National Assembly, require that the members are first able to hold meaningful, deep, and constructive discussions among themselves, and further; that they come up with well-thought-out and thorough conclusions which form instructive laws in this country.<\/p><p>I have watched parliamentary proceedings over the years and it is consistently evident that only a few MPs (ten or fifteen at most) will have any meaningful contribution on the floor of the house. I think this is in part because a lot of our MPs have nothing in their heads to offer, but I also believe it has a lot to do with the environment in which they operate.<\/p><p><strong>Let me explain&hellip;<\/strong><\/p><p>Someone moves a motion for thirty minutes. The first proposer supports it for fifteen minutes and then the second proposer does yet another fifteen minutes.<\/p><p>Two hours are gone, only three speakers! Then the opposing camp weighs in. Their two best guys go for one hour.<\/p><p>Five speakers, three hours! (<em>Of course, with timewasting points-of-order in between<\/em>).<\/p><p>We have three hundred and forty-nine (349) members in the house. What the hell are the rest supposed to do? Wait for the voting session? No wonder they just sleep through it!<\/p><p><strong>We&apos;re overrepresented <\/strong><\/p><p>Someone is about to remind me that our MPs represent&hellip;just stop it already! Look, this is the National Assembly. We are not talking about your village matters here. Your village constituency and its environs already have MCAs representing you at the County Assembly where they have a real voice, resources and actual work to do. Full stop.<\/p><p>Okay, that was harsh. But why, for instance, do we need eight (8) MPs representing Nairobi at the national assembly (in addition to countless MCAs, Women Rep, Governor and Senator!)? What are they representing?<\/p><p><strong>Back to my point<\/strong><\/p><p>I am convinced that if this country wanted to, and if we became more rational about these matters, ALL the functions of the National Assembly can be performed by the Senate &ndash; with a lot of ease and competence! I mean; if all the debates about national laws were taking place at the senate, won&apos;t we have better quality? How about the so called representation? Aren&apos;t the 47 senators a large enough number and truly functional face of the country? And yes, about the gender rule&hellip; okay, let&apos;s concede some ground: move the Women Reps to the Senate, in any case, don&apos;t they represent the same geographical constituencies as senators? What are they even doing in the National Assembly anyway?<\/p><p><strong>Benefits:<\/strong><\/p><p>1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Thirty billion shillings (Ksh.30BN) in savings on the recurrent budget.<\/p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 50-50 gender representation at the elective national level.<\/p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; No more shameful scenes that have become the order of the day in Muturi&apos;s parliament.<\/p><p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; No more power struggles between the upper and lower houses.<\/p><p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Less stress during campaigns&hellip;much fewer elections to be held.<\/p><p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The probability of an MP dying is higher than that of a senator (going by the numbers) hence fewer byelections, and less money spent by IEBC.<\/p><p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Fewer electoral petitions in the courts, so Maraga can ask for a little less money.<\/p><p>It beats my understanding how this country cannot just take a moment and look at the one simple solution that will make many, many problems just disappear.<\/p>","content_min":"<p>Much has been said about the Government wage bill, bloated National Assembly and the unsustainable recurrent expenditure budget.<\/p><p>I don&apos;t engage in politics a lot these days, so I will try not to turn political here and just say what is in my mind.<\/p><p>What if we just worked with the ","author":"@kelvinagengo","usr_id":"77","author_clean":"kelvinagengo","author_name":"Kelvin Agengo","author_img":"http:\/\/[::1]\/talk_new\/uploads\/profile\/8f73a7b22b3a6992da3fe3383ee03b66.jpg","type":"normal","published":"1533191793","date":"02-08-2018"}},"formatted":754,"position":"#5"},{"id":"755d4c000ffeccc7d881a869acb7aec467fa4967","count":597,"details":{"status":true,"published":true,"likes":4,"views":597,"comments":0,"article_fb":"http:\/\/www.facebook.com\/sharer.php?u=http:\/\/[::1]\/talk_new\/article\/the-government-cannot-deliver-affordable-housing-not-with-the-chinese-contractors~9b73c?p='fb'","article_twitter":"http:\/\/twitter.com\/intent\/tweet?url=http:\/\/[::1]\/talk_new\/article\/the-government-cannot-deliver-affordable-housing-not-with-the-chinese-contractors~9b73c?p='twitter'&text=The Government Cannot Deliver Affordable Housing, Not with The Chinese Contractors","article_linked":"https:\/\/www.linkedin.com\/cws\/share?url=http:\/\/[::1]\/talk_new\/article\/the-government-cannot-deliver-affordable-housing-not-with-the-chinese-contractors~9b73c?p='linked'&text=The Government Cannot Deliver Affordable Housing, Not with The Chinese Contractors","owner":false,"user_following":true,"user_liked":true,"isOnline":true,"details":{"identifier":"755d4c000ffeccc7d881a869acb7aec467fa4967","column":"Money & Business","url":"http:\/\/[::1]\/talk_new\/article\/the-government-cannot-deliver-affordable-housing-not-with-the-chinese-contractors~9b73c","title":"The Government Cannot Deliver Affordable Housing, Not with The Chinese Contractors","attachment":{"type":"image","meta":"","src":"http:\/\/[::1]\/talk_new\/uploads\/posts\/0fa438b1cbb2c709d9226c563a480d05.jpg"},"content":"<p>I watched the Housing PS on AM Live the other day trying to push the&nbsp;housing tax down the throats of his fellow panelists and by extension the rest of us. It was disappointing to say the least. This guy has no idea what he is talking about. First of all, and supposing they somehow manage to build the houses, he was all over the place about how these apartments would be sold to some people living in Kibera and other slums at the cost of 1.5million shillings after constructing them at 2million shillings&hellip;&hellip;I just switched off!<\/p><p>I will come to why I disagree with the government&apos;s approach to this important issue, but first, let me share with you what only a few people know about projects.<\/p><p><strong>In the beginning<\/strong><\/p><p>Most construction stories go something like this: Someone or entity wants to build something, so they start by hiring a team of experts (consultants) to conduct a feasibility study, then designs, costings, explore financing options and when convinced that they have most of the critical ground covered, they go to tender to on-board a contractor to implement the aspirations.<\/p><p><strong>What used to work<\/strong><\/p><p>There was a time when construction was simple. There was a design and a contractor. The contractor was the jack of all trades. He knew how to source for the most affordable materials and he had a number of experts working on his side. Projects were simple, technology was less advanced and there was a level of honesty. That was then.<\/p><p><strong>Times have changed<\/strong><\/p><p>Through the decades and with the evolution of technology, different players in the industry have found it increasingly difficult to be the &apos;jack of all trades&apos; due to the depth of mastery required to deliver effectively on the various aspects of construction.<\/p><p>What were formerly &apos;whole-works&apos; are today broken down into much smaller specialized &apos;sub-works&apos;.<\/p><p><strong>Enter the broker\/contractor<\/strong><\/p><p>At the very core of each sub-discipline, there is always good competition which inevitably drives up the quality and drives down the intrinsic costs. It is however unfortunate that the improved quality and lowered costs rarely reach the intended beneficiary-The Buyer.<\/p><p><strong>This is why:<\/strong><\/p><p>By the time the &apos;Contractor&apos; comes on board, the developer has no idea that he is dealing with an accomplished broker and not an expert.<\/p><p>This is how the modern-day contractor\/broker prepares his bid:<\/p><p>First, he asks all the different specialized smaller companies to submit to him their bids for sections of the works. He then sums all these up, adds his markup, then taxes and finally the amount of money that he has to borrow to finance the project before he puts in a claim for payment.<\/p><p>In practice, the developer generally ends up paying more than double the actual cost of the project.<\/p><p>Naturally, the developer will then add his own markup and cost of financing before selling to you an apartment at those rates we are all crying about now.<\/p><p>Obviously, this approach to things cannot deliver anything affordable; not in this country and not in the near future.<\/p><p><strong>Who can save us?<\/strong><\/p><p>I have thought about this for a while and only one group of people come to mind: The Consultants (<strong>Engineers, Architects, and Quantity Surveyors<\/strong>).<\/p><p>I have been toying with the idea of turning the current crop of consultants into project managers for real. Some of them already call themselves project managers but those are really just titles. If they became actual project managers, they would immediately replace the entity of the contractor\/broker and then be in charge of sourcing for the different specialists and materials on behalf of the developer.<\/p><p>In turn, we can reward them with a decent project manager&apos;s fee. Believe you me, these consultants will make a lot more money than they are making currently, but more importantly, the following will happen:<\/p><p>1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; It will be possible to save up to 40% on cost of construction by replacing the contractor with a project manager who is paid fees.<\/p><p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The real people who actually get the works done will have an opportunity to grow.<\/p><p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Chinese will go back to their motherland because we will have sealed the loopholes through which they are ripping off our country<\/p><p>Do I still have to explain why the government&apos;s affordable housing scheme will not work? We all know it: They are planning to use contractors; most of them Chinese, and we all know what the Chinese are here for.<\/p><p><em>There is a lot on construction and affordable housing, can I save some for next week? Be blessed.<\/em><\/p>","content_min":"<p>I watched the Housing PS on AM Live the other day trying to push the&nbsp;housing tax down the throats of his fellow panelists and by extension the rest of us. It was disappointing to say the least. This guy has no idea what he is talking about. First of all, and supposing they somehow manage to ","author":"@kelvinagengo","usr_id":"77","author_clean":"kelvinagengo","author_name":"Kelvin Agengo","author_img":"http:\/\/[::1]\/talk_new\/uploads\/profile\/8f73a7b22b3a6992da3fe3383ee03b66.jpg","type":"normal","published":"1538719017","date":"05-10-2018"}},"formatted":597,"position":"#6"},{"id":"cfc8205b73bcbbf2142e820e9290bad1c08a0954","count":558,"details":{"status":true,"published":true,"likes":4,"views":558,"comments":0,"article_fb":"http:\/\/www.facebook.com\/sharer.php?u=http:\/\/[::1]\/talk_new\/article\/all-is-not-lost-–-good-education-still-counts~9b73c?p='fb'","article_twitter":"http:\/\/twitter.com\/intent\/tweet?url=http:\/\/[::1]\/talk_new\/article\/all-is-not-lost-–-good-education-still-counts~9b73c?p='twitter'&text=All Is Not Lost – Good Education Still Counts","article_linked":"https:\/\/www.linkedin.com\/cws\/share?url=http:\/\/[::1]\/talk_new\/article\/all-is-not-lost-–-good-education-still-counts~9b73c?p='linked'&text=All Is Not Lost – Good Education Still Counts","owner":false,"user_following":true,"user_liked":true,"isOnline":true,"details":{"identifier":"cfc8205b73bcbbf2142e820e9290bad1c08a0954","column":"Education","url":"http:\/\/[::1]\/talk_new\/article\/all-is-not-lost-–-good-education-still-counts~9b73c","title":"All Is Not Lost – Good Education Still Counts","attachment":{"type":"image","meta":"","src":"http:\/\/[::1]\/talk_new\/uploads\/posts\/99e63224e8e374d3edf48aaf9900134b.PNG"},"content":"<p>&nbsp;<\/p><p>The promise of a bright future was the central theme of every motivational talk in school back in the day. I can remember several instances, getting motivated to study hard, grab academic excellence and all should be paradise. The motivational speakers would give appealing speeches enriched with tales of what awaited the top performers in class.<\/p><p>After every motivational talk, these academic elites had their faces radiating with life. Every student&apos;s dream in high school was to go to University. One thing was <em>certain<\/em>: you go through a university gate and you automatically enter the blissful paradise of success. How wrong we were! &nbsp;<\/p><p><strong>Reality check<\/strong><\/p><p>Today we know of myriad stories of university graduates, degree holders, first class honors; who are jobless, if not languishing in hardship. Life has tolled on them!<\/p><p>An incident was reported in the mainstream media early last year, where one graduate was found living with the street family in Kenya&apos;s capital, Nairobi city.<\/p><p>Nairobi is one city that has demoted many to the scratches of life, though it has also promoted some to the stretches of success. But what went wrong with the value that university degrees used to have? Has schooling lost its glory? Can we or will we get it back? &nbsp;&nbsp;&nbsp;<\/p><p><strong>Has <em>Degree<\/em> been rendered useless?&nbsp; <\/strong><\/p><p>Today it&apos;s hard to determine the genuineness of one&apos;s academic qualifications. But who then do we blame? Personally, I start with the students &ndash; those who earn their degrees through underhand methods. They hold papers that are not genuinely theirs.<\/p><p>Exam cheating has hit the roof in our learning institutions. This, in part, has led to the so called half-baked or no baked graduates.<\/p><p>The students fail to nurture their God given talents. They totally burry their heads in the sand, hoping to be absorbed by the job market after four, five or six years of study. It&apos;s then, after graduation, that they realize that there may be no jobs for the half-baked after all. &nbsp;&nbsp;&nbsp;<\/p><p><strong>Institutions are also to blame<\/strong><\/p><p>There is massive admission of students into the university and colleges by the infamous Kenya Universities and Colleges Central Placement Service (KUCCPS), yet the government fails to put in place adequate facilities and personnel to provide the desired standards of learning.<\/p><p>Chocked lecture halls, strained lab facilities, inadequate and insufficient learning equipment, and high student&ndash;teacher ratio or student&ndash;faculty ratio have become the order of the day in the country&apos;s institutions of higher learning.&nbsp;<\/p><p><strong>There has to be a change in mindset about success in life &nbsp;<\/strong><\/p><p>The perceived idea that only the book warmers become successful in life has been proven inaccurate. I used to draw my motivation from Ben Carson to read two books a week. However, I&apos;ve come to realize that you can still read only two chapters a week but spend the rest of the time growing your talent and become successful in life.<\/p><p>You could become a musician, orator, businessperson; whatever you&apos;re passionate about. Just do something that you feel fulfils your inner desires. Be a designer, be a footballer; explore your talent. Success is all about nurturing and pursuing that which you&apos;re good at. &nbsp;&nbsp;&nbsp;&nbsp;<\/p><p><strong>Wrap up <\/strong><\/p><p>Let&apos;s face it: we might not be able to change the status quo at the government level and make the leadership do better. But we can change our mindset and improve the situation right from the individual and institutional level.<\/p>","content_min":"<p>&nbsp;<\/p><p>The promise of a bright future was the central theme of every motivational talk in school back in the day. I can remember several instances, getting motivated to study hard, grab academic excellence and all should be paradise. The motivational speakers would give appealing speeches e","author":"@leonardondigo","usr_id":"140","author_clean":"leonardondigo","author_name":"Leonard Ondigo","author_img":"http:\/\/[::1]\/talk_new\/uploads\/profile\/a5e083ae0a10334ca476a6bd52f16f30.jpg","type":"normal","published":"1533875369","date":"10-08-2018"}},"formatted":558,"position":"#7"},{"id":"0bf3a2d789fdd5474d77007f953edb606a9a10d4","count":464,"details":{"status":true,"published":true,"likes":4,"views":464,"comments":0,"article_fb":"http:\/\/www.facebook.com\/sharer.php?u=http:\/\/[::1]\/talk_new\/article\/one-leg-inside-chinas-debt-trap-–-when-will-kenya-see-that-these-loans-are-a-trap~9b73c?p='fb'","article_twitter":"http:\/\/twitter.com\/intent\/tweet?url=http:\/\/[::1]\/talk_new\/article\/one-leg-inside-chinas-debt-trap-–-when-will-kenya-see-that-these-loans-are-a-trap~9b73c?p='twitter'&text=One Leg Inside China's Debt Trap – When Will Kenya See That These Loans Are A Trap?","article_linked":"https:\/\/www.linkedin.com\/cws\/share?url=http:\/\/[::1]\/talk_new\/article\/one-leg-inside-chinas-debt-trap-–-when-will-kenya-see-that-these-loans-are-a-trap~9b73c?p='linked'&text=One Leg Inside China's Debt Trap – When Will Kenya See That These Loans Are A Trap?","owner":false,"user_following":true,"user_liked":false,"isOnline":true,"details":{"identifier":"0bf3a2d789fdd5474d77007f953edb606a9a10d4","column":"Politics & Leadership","url":"http:\/\/[::1]\/talk_new\/article\/one-leg-inside-chinas-debt-trap-–-when-will-kenya-see-that-these-loans-are-a-trap~9b73c","title":"One Leg Inside China's Debt Trap – When Will Kenya See That These Loans Are A Trap?","attachment":{"type":"image","meta":"","src":"http:\/\/[::1]\/talk_new\/uploads\/posts\/fe02b5d44b4393c9f3c7a3bdfecc3aa6.JPG"},"content":"<p>Sri Lanka was just recently forced to lease out their strategic port of Hambantota to China for a period of 99years. Reason? Sri Lanka&apos;s president Mahinda Rajapaksa had been getting a &ldquo;yes&rdquo; answer every time he turned to China for loans &ndash; until it was too much to repay in cash! Sounds familiar?<\/p><p>Look, I am not against Kenya seeking monetary assistance from China. I mean, borrowing to spend wisely on projects with high economic returns is ideal. But borrowing only to launder is so out of line. For this way, our fate as a nation is dangling over an abyss of second colonization.<\/p><p><strong>Too much loan <\/strong><\/p><p>The state is accumulating too much debt&nbsp;that will someday render us servants to the Chinese. In fact, studying this trend, there is no point in time when we&apos;ll be able to develop as a country, not with the debt weighing us down.<\/p><p>We shall forever wallow in a deep pool of unpaid loans&nbsp;that were borrowed using the name &#39;Kenya&#39; but ended up being looted and benefiting few individuals who in the end use the same money to buy justice. And the common <em>mwanainchi<\/em> will be hit with exorbitant tax rates to carry.<\/p><p><strong>Hyena in a sheepskin &ndash; a deep trap! <\/strong><\/p><p>What we are getting ourselves into is a debt trap. And what China is doing to Africa is silent economic bullying. That country is a hyena in a sheepskin &ndash; waiting to pounce when the right time comes. And there&apos;s enough indication to that regard already.<\/p><p>Aside from Sri Lanka, Zimbabwe almost sold off its mineral rights to China because they couldn&#39;t pay off their debt on time. &nbsp;Djibouti is at the verge of losing&nbsp;control of a port to state-controlled Chinese firms as a result of defaulting on Chinese loans. Angola, despite being the second largest oil producing country in Africa, has little oil to export as these same Chinese control a huge amount of it. Why? Loan trap!<\/p><p><strong>A sad situation <\/strong><\/p><p>Those who are borrowing from China probably couldn&apos;t care less about the repercussions for they might not even be alive by the time the consequences of their actions kick in, to have a taste of it. It is us, the young generations, that will suffer this gloomy aftermath.<\/p><p>Kenya, just as many other African countries, is immersed in corruption. These loans are jackpots to specific people. Almost all of this country&#39;s budget always finds a way to spiral into scandals that eventually end up as&nbsp;a wild goose chase.<\/p><p><strong>Keep an eye out, lest we wake up China&#39;s national anthem<\/strong><\/p><p>Something should be done to tone down our governemnt&#39;s appetite for monetary aid. There has to be put forth a measure to control and\/or monitor the executive&#39;s loan acquisition habit. We can even come up with ways and possible economic options so that we could stop overdependence on foreign aid. Otherwise, we will one day wake up to China&#39;s national anthem. And they might acquire more confidence to refer to us as monkeys.&nbsp;<\/p>","content_min":"<p>Sri Lanka was just recently forced to lease out their strategic port of Hambantota to China for a period of 99years. Reason? Sri Lanka&apos;s president Mahinda Rajapaksa had been getting a &ldquo;yes&rdquo; answer every time he turned to China for loans &ndash; until it was too much to repay in c","author":"@angelyneobonyo","usr_id":"149","author_clean":"angelyneobonyo","author_name":"Angelyne Obonyo","author_img":"http:\/\/[::1]\/talk_new\/uploads\/profile\/21f8615cdbfd5889f3075cc632866166.jpg","type":"normal","published":"1537162542","date":"17-09-2018"}},"formatted":464,"position":"#8"},{"id":"3e441d92407d76c7491131525fb1340cee7720fc","count":392,"details":{"status":true,"published":true,"likes":4,"views":392,"comments":0,"article_fb":"http:\/\/www.facebook.com\/sharer.php?u=http:\/\/[::1]\/talk_new\/article\/breasts-have-power-but-still-need-protection~9b73c?p='fb'","article_twitter":"http:\/\/twitter.com\/intent\/tweet?url=http:\/\/[::1]\/talk_new\/article\/breasts-have-power-but-still-need-protection~9b73c?p='twitter'&text=Breasts Have Power but Still Need Protection","article_linked":"https:\/\/www.linkedin.com\/cws\/share?url=http:\/\/[::1]\/talk_new\/article\/breasts-have-power-but-still-need-protection~9b73c?p='linked'&text=Breasts Have Power but Still Need Protection","owner":false,"user_following":true,"user_liked":true,"isOnline":true,"details":{"identifier":"3e441d92407d76c7491131525fb1340cee7720fc","column":"Health","url":"http:\/\/[::1]\/talk_new\/article\/breasts-have-power-but-still-need-protection~9b73c","title":"Breasts Have Power but Still Need Protection","attachment":{"type":"image","meta":"","src":"http:\/\/[::1]\/talk_new\/uploads\/posts\/b1eb4afc1144a949687d6a33ed61f9f9.PNG"},"content":"<p>We all suckled. In those glandular epithelial tissues protruding against mama&apos;s chest we found a liquid that quenched our childhood thirsts. We clang on them for nutrition, and for all of us who were lucky to suckle, we could never overemphasize the value of those breasts. We should surely be thankful that our mothers had healthy breasts.<\/p><p>Ancient folk valued the breasts, even more than we do today. Women cherish them while men adore these beautiful organs. With poems and songs, liquid lyrics and magnificent melodies, people have sung praises to them. Even the&nbsp;Bible had a thing to say about breasts:&nbsp;&ldquo;<em>This stature of yours is like a palm tree, and your breasts like its clusters.&rdquo; <\/em><em>Song of Solomon 7:7<\/em><\/p><p><strong>Sad reality<\/strong><\/p><p>While breasts are clearly one of the most cherished, vital organs in the woman&apos;s body, they remain one of the most vulnerable to today&apos;s leading killer disease, cancer. According to an article by A Korir dated July 2, 2015, the most common cancer in women is breast cancer. That should be quite disturbing.<\/p><p>You see, I&apos;m quite a lucky man. I have not had any one of my relatives diagnosed with cancer. I haven&apos;t even shaken hands with any reality case of cancer. I have, however, studied about it in class, where we called it Neoplasia &ndash; a name that makes it appear more dreadful, like a nuclear bomb that could blast a city. &nbsp;<\/p><p><strong>A turning point <\/strong><\/p><p>Recently, a friend of mine, very dear to me, opened up to me about her situation. Well, we&apos;re used to the regular &ldquo;How are you?&rdquo; as the chat opener, and the haphazard &ldquo;I&apos;m fine&rdquo; as the reply. But today was different.<\/p><p>A few sentences into our conversation, and it becomes apparent that something is the matter. She sounds sad and in tears. She asks me to tell my girlfriend to go for regular breast and cervical cancer screening, and adds, &ldquo;We tend to assume that we are normal till it hits home.&rdquo; Slowly, I get the message!<\/p><p>So it happens that she discovered she is suffering from breast cancer a while back. I can&apos;t stand the thought of losing my friend to this menace. The thought of John McCain who recently succumbed to cancer lingers in my head, and it all becomes too much for me to stomach.<\/p><p>But&hellip; a quick assurance. She tells me that she is under medication and she will be well. A reprieve. Fortunately, she discovered the case at an early stage.<\/p><p><strong>Listen to the drum and act yourself responsible<\/strong><\/p><p>I know that ladies have been encouraged and persuaded over and over to go for regular cancer screenings. But we will not tire to continue drumming this beat, &ldquo;PLEASE GO FOR CANCER SCREENINGS AT LEAST ONCE EVERY 1 TO 3 YEARS!&rdquo; You never know.<\/p><p>This message I was given to share with my girlfriend, I&apos;m sharing it with all my girlfriends out there and my boyfriends who have girlfriends out of philanthropy. Heed the call. Stand up and be counted for taking part in the fight to defeat cancer. Beware that your <em>powerful tool<\/em>, breast, is under attack. And for cancer, prevention is surely better than cure.<\/p><p><strong>In a nutshell <\/strong><\/p><p>October is Breast Cancer Awareness Month and you don&apos;t want to miss the opportunity for your screening. Please make time for it, tell a friend. And never stop with one, leverage any opportunity that pops up for cancer screening and stay safe.<\/p>","content_min":"<p>We all suckled. In those glandular epithelial tissues protruding against mama&apos;s chest we found a liquid that quenched our childhood thirsts. We clang on them for nutrition, and for all of us who were lucky to suckle, we could never overemphasize the value of those breasts. We should surely b","author":"@leonardondigo","usr_id":"140","author_clean":"leonardondigo","author_name":"Leonard Ondigo","author_img":"http:\/\/[::1]\/talk_new\/uploads\/profile\/a5e083ae0a10334ca476a6bd52f16f30.jpg","type":"normal","published":"1537775825","date":"24-09-2018"}},"formatted":392,"position":"#9"},{"id":"c3ae9298e4aa10d8d9c87019d9fab693284ce8c3","count":389,"details":{"status":true,"published":true,"likes":3,"views":389,"comments":0,"article_fb":"http:\/\/www.facebook.com\/sharer.php?u=http:\/\/[::1]\/talk_new\/article\/truth-be-said-people-kill-people-the-roads-are-innocent~9b73c?p='fb'","article_twitter":"http:\/\/twitter.com\/intent\/tweet?url=http:\/\/[::1]\/talk_new\/article\/truth-be-said-people-kill-people-the-roads-are-innocent~9b73c?p='twitter'&text=Truth Be Said: People Kill People, The Roads Are Innocent","article_linked":"https:\/\/www.linkedin.com\/cws\/share?url=http:\/\/[::1]\/talk_new\/article\/truth-be-said-people-kill-people-the-roads-are-innocent~9b73c?p='linked'&text=Truth Be Said: People Kill People, The Roads Are Innocent","owner":false,"user_following":true,"user_liked":true,"isOnline":true,"details":{"identifier":"c3ae9298e4aa10d8d9c87019d9fab693284ce8c3","column":"Politics & Leadership","url":"http:\/\/[::1]\/talk_new\/article\/truth-be-said-people-kill-people-the-roads-are-innocent~9b73c","title":"Truth Be Said: People Kill People, The Roads Are Innocent","attachment":{"type":"image","meta":"","src":"http:\/\/[::1]\/talk_new\/uploads\/posts\/4a638c551b11480a896010e6893999be.jpg"},"content":"<p>If the level of freedom surpassed the level corruption in my country Kenya, I would publish a book titled &ldquo;People Kill People, The Roads are Innocent&rdquo;.&nbsp; If time is money then Kenyans waste a ton&nbsp;of cash on the roads through extraordinary traffic jams and enormous traffic police negligence.<\/p><p>Should we continue to tolerate the rising number of deaths because people have refused to do what they are paid to do?<\/p><p><strong>Who is negligent?<\/strong><\/p><p>No, I&apos;m not going to start shouting the name, &apos;<em>Serikali<\/em>&apos; here; though I will, later. The Kenyan passenger is negligent for failing to reason regardless of our country being one of the most innovative ones in Africa. While majority of Kenyans use public transport, they bemuse me how unconcerned they are about their safety on the roads.<\/p><p>From sitting on &apos;space&apos; between two seats in a public service vehicle, to standing in a full bus; Kenyan passengers&apos; negligence is absurd.<\/p><p>If reading before exams makes sense to you then inspecting the roads before gruesome accidents should also influence your thinking in the same way. A slight <em>inspection<\/em> of a vehicle and its operators before boarding it is not being nosy, but careful.<\/p><p><strong>Why we should care<\/strong><\/p><p>The only person I trust with my life without questioning is the <em>Matatu<\/em> driver. I trust him with my future projects when I leave them halfway and board his bus. I trust him with my girlfriend when she comes onboard. I trust him with my money when I give out some of it as bus fare and believe that he will give me an opportunity to use the rest. Sometimes I trust him with the whole of my life. Same to you.<\/p><p>For fathers, they trust the drivers with the lives of their children if not the whole family. The &apos;<em>Zusha<\/em>&apos; campaign is no more effective in the contemporary Kenya where netizens know it all as they pour it all out on Twitter.<\/p><p>We should care because disability rates are rising; because children&apos;s homes are getting flooded; because the numbers of widows are going through the roof; because young people&apos;s dreams are not only getting shattered, but also dying on broad daylights and silent nights.<\/p><p><strong>The roads are not to blame <\/strong><\/p><p>Truth be said, people kill people, the roads don&apos;t. I wouldn&apos;t wish to talk about the recent gruesome accident that claimed the lives of a whopping 51 people along Muhoroni-Londiani road. Even so, I will give a glimpse of some facts regarding the accident just for the reader to see that the roads are not guilty as charged! The people are.<\/p><p>The late driver was 75 years old (according to some reliable sources). The passengers raised complaints but did not care to take any action. Further, the accident scene is notorious for several other accidents even though nothing worth mentioning has been done about it. Each fact here has a fault to note. Please note them.<\/p><p><strong>Call for action<\/strong><\/p><p>Celebrated CNN business anchor Richard Quest opened floodgates to talking critically about the state of the Kenyan roads. Through his short tweet, he openly questioned the need for both traffic police and new traffic lights on the Kenyan roads. Most netizens advocated for the <em>&apos;cheza chini&apos;<\/em> Kenyan norm. &apos;<em>Cheza chini<\/em>&apos; literally means covering the ugly stuff using cunning ways.&nbsp;<\/p><p>Meanwhile, a number of unpleasant facts about the country&apos;s traffic situation came to light through the conversation &ndash; thanks to the freedom of expression on social media in Kenya that Ugandans salivate and pay for.<\/p><p>The government, the traffic authorities, and more importantly, YOU; are responsible for sobriety on Kenyan roads.<\/p>","content_min":"<p>If the level of freedom surpassed the level corruption in my country Kenya, I would publish a book titled &ldquo;People Kill People, The Roads are Innocent&rdquo;.&nbsp; If time is money then Kenyans waste a ton&nbsp;of cash on the roads through extraordinary traffic jams and enormous traffic pol","author":"@stevethe","usr_id":"162","author_clean":"stevethe","author_name":"Steve The","author_img":"http:\/\/[::1]\/talk_new\/uploads\/profile\/f3263ff90f5bd77f2efd6314c2bc509b.jpg","type":"normal","published":"1541840013","date":"10-11-2018"}},"formatted":389,"position":"#10"},{"id":"97e46d8e2c101af10ea6bca006f545f8fa5cd6d6","count":358,"details":{"status":true,"published":true,"likes":2,"views":358,"comments":0,"article_fb":"http:\/\/www.facebook.com\/sharer.php?u=http:\/\/[::1]\/talk_new\/article\/stop-giving-students-helb-loans-they-need-help-instead~9b73c?p='fb'","article_twitter":"http:\/\/twitter.com\/intent\/tweet?url=http:\/\/[::1]\/talk_new\/article\/stop-giving-students-helb-loans-they-need-help-instead~9b73c?p='twitter'&text=Stop Giving Students HELB Loans, They Need HELP Instead","article_linked":"https:\/\/www.linkedin.com\/cws\/share?url=http:\/\/[::1]\/talk_new\/article\/stop-giving-students-helb-loans-they-need-help-instead~9b73c?p='linked'&text=Stop Giving Students HELB Loans, They Need HELP Instead","owner":false,"user_following":true,"user_liked":true,"isOnline":true,"details":{"identifier":"97e46d8e2c101af10ea6bca006f545f8fa5cd6d6","column":"Education","url":"http:\/\/[::1]\/talk_new\/article\/stop-giving-students-helb-loans-they-need-help-instead~9b73c","title":"Stop Giving Students HELB Loans, They Need HELP Instead","attachment":{"type":"image","meta":"","src":"http:\/\/[::1]\/talk_new\/uploads\/posts\/766b57470e2c478f2ae67983163dc686.PNG"},"content":"<p>With my scanty knowledge of commerce and economics, I know that loans are meant for investing rather than spending. Financial institutions advise so, and sometimes even seek for proof of what one intends to use the loan for before giving it out. This is the moral law that governs any lending transaction.<\/p><p>One of the most, if not the most, popular loans in Kenya is Higher Education Loans Board (HELB) loan. I remember I started hearing about this loan when I was in high school (form one). The university students made it easily known to us that it was the campus spoiler, that it was huge and you could spend it the way you wanted.<\/p><p><strong>The reality<\/strong><\/p><p>Despite those many theories and teeter talks that made us have a poor picture of the loan, when I got to campus, I found that the loan was in the first place very lean. In many instances I finished it within two weeks. I know some of my friends who could dry it out within two days or so. It just ran out so fast. And some of my friends even speculated whether HELB had some magical wand that you could dry it out that fast and didn&apos;t see anything you did with it.<\/p><p>Being in campus comes with some clout. You need to have the latest phone, a woofer or home theatre, 32inch HD TV. And some feel a nudge for weekend raves; drink some expensive liquor. These among many other factors have made students misuse the money.<\/p><p>When they finish campus, they are faced with a reality; that they have to pay back the money and that there are no jobs readily awaiting them.<\/p><p><strong>Why HELB loans should be stopped<\/strong><\/p><p>Why should you give a loan to someone who cannot support him\/herself on basic needs and expect them to use it wisely? How do you give loans while you have not provided opportunities for jobs? I mean every lender must be assured of the borrower&apos;s capacity to pay back the loan. Why must the son\/daughter of a poor family or an orphan be given a loan while education has now lost its ancient glory?<\/p><p>We have ended up teaching our youths that loans are to be expended on needs rather than invested, because we have given them loans to spend in campus. They have spent it on drinking sprees, buying home theatres, and many other menial luxuries.<\/p><p>Today we have people who still believe they should take loans to keep themselves comfortable, rather than invest. They apply for loans to take their girlfriends out or for wedding arrangements. Haven&apos;t we messed up our youths?<\/p><p><strong>Between a rock and a hard place<\/strong><\/p><p>While students are given loans, they are not guaranteed a sustaining job. A job that will help them pay back the loan. Truth be told, there is not a grievous problem this country faces more than jobless youth.<\/p><p>Many have graduated and have no jobs. They need to survive, so some resort to crime, some work really hard; even putting their lives in danger. But I also know a host of youths who have ventured into loan taking spree &ndash; as the rich bourgeoisies have come up with various loan businesses: Branch, Tala, Mkopa, Mshwari, Jambo loans, Haraka loans, Said, Easy Loans, Sasa Loans among many others. These are meant to apprehend the jobless youth to a difficult situation. The Kenyan youth is now between a rock and a hard place.<\/p><p><strong>What should be done<\/strong><\/p><p>Students need what I may call &apos;HELP&apos; (Healthy and Educative Lifestyle Pocket) Money. HELP them. Rather than put the youths who are brilliant but financially unstable through this gutter of life, a life full of loans but few opportunities.<\/p><p>The government has to reconsider. Start giving pocket money rather than loans to students. Even if the pocket money is lean. Sponsor their tuition fees the way it has been done but never give loans to students, award them small pocket money to help them meet their basic needs.<\/p><p>We can&apos;t continue having a government and a society which runs on loans and debts from students to the national level. To continue giving loans to students is not only bad for the economy but it also harms the students&apos; lives after campus. The loan conditions the students to be poor investors and loan impropriators.<\/p>","content_min":"<p>With my scanty knowledge of commerce and economics, I know that loans are meant for investing rather than spending. Financial institutions advise so, and sometimes even seek for proof of what one intends to use the loan for before giving it out. This is the moral law that governs any lending tran","author":"@leonardondigo","usr_id":"140","author_clean":"leonardondigo","author_name":"Leonard Ondigo","author_img":"http:\/\/[::1]\/talk_new\/uploads\/profile\/a5e083ae0a10334ca476a6bd52f16f30.jpg","type":"normal","published":"1538803418","date":"06-10-2018"}},"formatted":358,"position":"#11"},{"id":"d8ee2e563dfba1ca16217c254a5d8cbc0627c121","count":310,"details":{"status":true,"published":true,"likes":2,"views":310,"comments":2,"article_fb":"http:\/\/www.facebook.com\/sharer.php?u=http:\/\/[::1]\/talk_new\/article\/why-eradicating-hiv-aids-in-kenya-is-a-harder-battle-than-many-people-comprehend~9b73c?p='fb'","article_twitter":"http:\/\/twitter.com\/intent\/tweet?url=http:\/\/[::1]\/talk_new\/article\/why-eradicating-hiv-aids-in-kenya-is-a-harder-battle-than-many-people-comprehend~9b73c?p='twitter'&text=Why Eradicating HIV AIDS in Kenya Is a Harder Battle Than Many People Comprehend","article_linked":"https:\/\/www.linkedin.com\/cws\/share?url=http:\/\/[::1]\/talk_new\/article\/why-eradicating-hiv-aids-in-kenya-is-a-harder-battle-than-many-people-comprehend~9b73c?p='linked'&text=Why Eradicating HIV AIDS in Kenya Is a Harder Battle Than Many People Comprehend","owner":false,"user_following":true,"user_liked":false,"isOnline":true,"details":{"identifier":"d8ee2e563dfba1ca16217c254a5d8cbc0627c121","column":"Health","url":"http:\/\/[::1]\/talk_new\/article\/why-eradicating-hiv-aids-in-kenya-is-a-harder-battle-than-many-people-comprehend~9b73c","title":"Why Eradicating HIV AIDS in Kenya Is a Harder Battle Than Many People Comprehend","attachment":{"type":"image","meta":"","src":"http:\/\/[::1]\/talk_new\/uploads\/posts\/45d23eb71e1c678b38981b59ecd03c43.jpeg"},"content":"<p>No one engages in unprotected sex quicker than a tipsy Kenyan youth at a party &ndash; especially a house party. I know a whole lot about this stuff, and I&apos;m going to share a bit with you.<\/p><p>There&apos;s a very interesting form of division of labor in these circles. Normally, when you&apos;re attending the parties, it&apos;s simple: you either bring <em>madem<\/em> (women) or <em>mzinga<\/em> (a tall bottle of strong alcoholic beverage, often whisky or vodka).<\/p><p>It typically goes something like: &ldquo;<em>leta madem, kuna mzinga&rdquo; <\/em>(loosely translating as &ldquo;bring gals, there&apos;s alcohol&rdquo;). Or: &ldquo;<em>leta mzinga, kuna madem<\/em>&rdquo; (come with&nbsp;alcohol, there are gals).<\/p><p>Now, here&apos;s the sad part. These <em>madem<\/em> are someone&apos;s sisters or daughters (often both, of course). I&apos;m trying to imagine my sister and a bottle of alcohol appearing in the same breath!<\/p><p>While the statement may feel easy to utter and harmless on the surface, it demeans these future first ladies. &nbsp;<\/p><p><strong>Uncontrolled behavior at the parties <\/strong><\/p><p>In 2015, Nairobi was ranked number one in Africa on entertainment. The love for fun is hardwired in Kenyans&apos; DNA &ndash; we are willing spenders when it comes to entertainment. And while that&apos;s not exactly a bad thing, it has a lot to do with the problem of widespread HIV pandemic in the country.<\/p><p>There&apos;s a lot that goes on at the parties. I&apos;m not referring to commercial clubbing activity, but the liquor-laden type of merriment that Kenyan youths love so much. It&apos;s typically something organized by a group of students or some like-minded, fun-thirsty young folk in a residential place; often a big house with several rooms.<\/p><p><strong>Loud music. Drinks. Corridors. And many rooms&hellip;<\/strong><\/p><p>In these setups, young people lose their senses. They become uninhibited and spontaneous, and the use of condoms or safe sex overall becomes a myth.<\/p><p>Much as you may be unaware, there&apos;s quite a lot of these parties that happen nearly every day. And HIV always finds a way to change hands. &nbsp;<\/p><p>With this picture in mind, you begin to see why our Kenya has just been ranked FOURTH WORLDWIDE in HIV infections, trailing only South Africa, Nigeria and India.<\/p><p>Even more importantly, you begin to see why more than half (51%) of all new HIV infections in Kenya in the report involve young people aged 15-24 years. &nbsp;<\/p><p>This is particularly worrying, because it means the very generation that we hope to drive our economy and take custody of it tomorrow is the most affected; the one we&apos;re losing to HIV AIDS.<\/p><p><strong>Let&apos;s talk about condoms <\/strong><\/p><p>For one, gals (read ladies) don&apos;t like them. I know, at a personal level, numerous ladies (very cool females, quite respectable people, good Christians even) who &ldquo;just DON&apos;T like condoms&rdquo;. (The part in quotes are not my words, but theirs).<\/p><p>Boys (men, male humans) on the other hand are divided between having safe sex and satisfying the desires of these females. Trust me, the latter always wins.<\/p><p>It&apos;s a messy situation. Men are creatures of ego. And they won&apos;t risk &apos;failing&apos; their woman even at the cost of putting their own health at risk. Let&apos;s face it; the woman has said that she hates the latex &ndash; its smell makes her nauseous. Would you, a man, go ahead and use it anyway? What if she decides to look for someone else who is willing to &apos;do it bare&apos; the way she wants? &nbsp;<\/p><p><strong>We could make a difference if we try <\/strong><\/p><p>Until when will we keep being associated only with the bad, negative stuff as a country?<\/p><p>Kenya used to be our motherland. I miss that Kenya. Because today, it&apos;s the mother of corruption, over-taxation, bad governance, overrepresentation in the legislature, 2022 politics, and now, sadly, HIV infections.<\/p><p>It&apos;s right here in Kenya where politicians use taxpayer money to go watch the World Cup (football) in Russia but cannot go to cheer the country&apos;s national team in an important derby at a local stadium.<\/p><p>It&apos;s here in Kenya (Baringo County) <a href=\"https:\/\/www.tuko.co.ke\/287421-baringo-county-where-pupils-school-food.html#287421\">where pupils go to school because of food<\/a> while their leaders forget to carry notebooks and pens when accompanying the president to a meeting in a foreign country.<\/p><p>Come on people. We can do better. We can battle HIV. It starts with you and me.<\/p>","content_min":"<p>No one engages in unprotected sex quicker than a tipsy Kenyan youth at a party &ndash; especially a house party. I know a whole lot about this stuff, and I&apos;m going to share a bit with you.<\/p><p>There&apos;s a very interesting form of division of labor in these circles. Normally, when you&ap","author":"@nicodemusnyambok","usr_id":"139","author_clean":"nicodemusnyambok","author_name":"Nicodemus Nyamb...","author_img":"http:\/\/[::1]\/talk_new\/uploads\/profile\/182e8b87a81195a01c8aa5ddbc9816c5.png","type":"normal","published":"1538456036","date":"02-10-2018"}},"formatted":310,"position":"#12"},{"id":"5af7b14064e81317184f2358454cb8b64d534f9d","count":306,"details":{"status":true,"published":true,"likes":4,"views":306,"comments":2,"article_fb":"http:\/\/www.facebook.com\/sharer.php?u=http:\/\/[::1]\/talk_new\/article\/why-online-writing-is-light-at-the-end-of-the-tunnel-for-kenya’s-unemployed-youth- ~9b73c?p='fb'","article_twitter":"http:\/\/twitter.com\/intent\/tweet?url=http:\/\/[::1]\/talk_new\/article\/why-online-writing-is-light-at-the-end-of-the-tunnel-for-kenya’s-unemployed-youth- ~9b73c?p='twitter'&text=Why Online Writing Is Light at The End of The Tunnel for Kenya’s Unemployed Youth  ","article_linked":"https:\/\/www.linkedin.com\/cws\/share?url=http:\/\/[::1]\/talk_new\/article\/why-online-writing-is-light-at-the-end-of-the-tunnel-for-kenya’s-unemployed-youth- ~9b73c?p='linked'&text=Why Online Writing Is Light at The End of The Tunnel for Kenya’s Unemployed Youth  ","owner":false,"user_following":true,"user_liked":true,"isOnline":true,"details":{"identifier":"5af7b14064e81317184f2358454cb8b64d534f9d","column":"Money & Business","url":"http:\/\/[::1]\/talk_new\/article\/why-online-writing-is-light-at-the-end-of-the-tunnel-for-kenya’s-unemployed-youth- ~9b73c","title":"Why Online Writing Is Light at The End of The Tunnel for Kenya’s Unemployed Youth  ","attachment":{"type":"image","meta":"","src":"http:\/\/[::1]\/talk_new\/uploads\/posts\/3f7346b0e196ef7a0219ca68f379e580.PNG"},"content":"<p><br \/>The gap that yawns between poverty and riches, lack and stability, inadequacy and sufficiency, unemployment and security has always called for endless tussles in life. As it is, money has been and continues to be the bridge, so to say, between the islands of the haves and the lowlands of the have nots. And anyone who desires to walk into the sunny beaches of comfort within the stupendous island of riches must hustle and shake hands with some serious money.&nbsp;<\/p><p><strong>Sad reality<\/strong><br \/>First, the economic lag that exists in Kenya has left many people drowning in poor standards of living. A disturbing statistic released in 2017 by Business Daily indicated that Kenya&apos;s youth unemployment sits at a comfortable rate of 20.3 per cent (for the 15-24 years age bracket). This creates a situation where the most energetic and creative labour is rendered idle while the aged and unproductive folk keep floating in top offices making very little contribution to the already struggling economy. &nbsp;<\/p><p>Second, universities and colleges continue to cough out graduates. The Daily Nation Newspaper of 24th Dec 2017 revealed that universities and colleges churn out tens of thousands of graduates each year. The saddest part, however, is that with few companies hitherto, the job market is not prepared to absorb all that labor.&nbsp;<\/p><p>In 2015 alone, we had around 49,000 graduates. The number has since increased.&nbsp;<\/p><p><strong>More demons for the youths!<\/strong><br \/>Beside the lack of substantive job placement for youths, there is the lack of capital for business startups. There are many young people who are passionate about pursuing business but do not have the necessary funds to invest. So far, no relevant government agency has sufficiently fueled these prospects. There have been youth funds and Uwezo funds but both of these remain obscured in bureaucracy and inaccessible to many youths. &nbsp;<\/p><p>Those who successfully roll out their businesses have marketing challenges or inadequate market to contend with. It almost feels hopeless for the Kenyan youth. &nbsp;<\/p><p><strong>Flickers of hope<\/strong><br \/>Writing to get paid, or online writing as others call it, is open to all fresh graduates. This is a job whose requirements are not overly exaggerated. You don&apos;t need a 10-year experience or a prominent resume to enter the industry; rather, all you need is your computer keyboard and strong internet connection.&nbsp;<\/p><p>Who doesn&apos;t want to work from the comfort of their homes and earn the same or even more than a salaried employee?&nbsp;<\/p><p><strong>Caveat: money is like honey with bees that sting<\/strong><br \/>That every cloud has a silver lining is popular knowledge. But how I wish they also noted that behind every cloud with a silver lining lies a probable chance of lighting and thunder. Why? Because it&apos;s true that every beautiful rose has a thorn beneath and therefore must be touched carefully.<\/p><p>The online writing gig could bring huge sums of money. This calls for careful spending, lest you find yourself drawn into poor prioritization and all manner of insidious behavior that might leave you with tears. &nbsp;<\/p><p><strong>Get some financial education<\/strong><br \/>Your online bosses won&apos;t teach you how to use the money. They will give it to you but not ever show you how to manage it. So, ensure you get some financial education &ndash; everyone needs it.<\/p><p><strong>Write, Think, Invest<\/strong><br \/>The best place for your money is not banking, it&apos;s investing. When you invest, you provide the money with opportunity to have an intercourse with ideas and give birth to more money. Security is in prosperity not safety. Your cash can be safe at the bank but will it grow? To my brothers and sisters in the online writing employment, continue to Write, Think and Invest.<\/p>","content_min":"<p><br \/>The gap that yawns between poverty and riches, lack and stability, inadequacy and sufficiency, unemployment and security has always called for endless tussles in life. As it is, money has been and continues to be the bridge, so to say, between the islands of the haves and the lowlands of th","author":"@leonardondigo","usr_id":"140","author_clean":"leonardondigo","author_name":"Leonard Ondigo","author_img":"http:\/\/[::1]\/talk_new\/uploads\/profile\/a5e083ae0a10334ca476a6bd52f16f30.jpg","type":"normal","published":"1534824314","date":"21-08-2018"}},"formatted":306,"position":"#13"},{"id":"28173dbb4327e6e17c9532aeb8db50516b2cc4a7","count":306,"details":{"status":true,"published":true,"likes":4,"views":306,"comments":2,"article_fb":"http:\/\/www.facebook.com\/sharer.php?u=http:\/\/[::1]\/talk_new\/article\/that-is-a-soul-that-would-have-built-a-nation~9b73c?p='fb'","article_twitter":"http:\/\/twitter.com\/intent\/tweet?url=http:\/\/[::1]\/talk_new\/article\/that-is-a-soul-that-would-have-built-a-nation~9b73c?p='twitter'&text=That is a Soul That Would Have Built a Nation","article_linked":"https:\/\/www.linkedin.com\/cws\/share?url=http:\/\/[::1]\/talk_new\/article\/that-is-a-soul-that-would-have-built-a-nation~9b73c?p='linked'&text=That is a Soul That Would Have Built a Nation","owner":false,"user_following":true,"user_liked":true,"isOnline":true,"details":{"identifier":"28173dbb4327e6e17c9532aeb8db50516b2cc4a7","column":"Inspiration","url":"http:\/\/[::1]\/talk_new\/article\/that-is-a-soul-that-would-have-built-a-nation~9b73c","title":"That is a Soul That Would Have Built a Nation","attachment":{"type":"image","meta":"","src":"http:\/\/[::1]\/talk_new\/uploads\/posts\/7029fb0b943214abd87ae77903615887.PNG"},"content":"<p>The date is 6th September 2018, around 3pm. I&apos;m supposed to attend a meeting at Caf&eacute; Deli (Nairobi) but from the look of things, it&apos;s going to take a while before this meeting kicks off. So I install myself on one of those public benches in town just to ponder.<\/p><p>It&apos;s then that I get distracted by a dramatic scene barely 10 metres away from where I&#39;m&nbsp;sitting: the sight of a&nbsp;guy in tatters, quite dirty; his&nbsp;skin bruised and tattooed with scars. He has one leg and is supporting himself with crutches. Strategically positioned among parked cars, the guy&nbsp;begs for cash from every willing (and unwilling) passerby.&nbsp;<\/p><p>Studying him closely, I notice that the man seems quite disturbed and rather agitated. He repeatedly throws his hands in the air when he gets nothing but an excuse from those he is begging from. He then lights a cigarette and smokes it riotously. 5 minutes, and the poor chap has finished 2 cigarettes.<\/p><p><strong>Cigar, a new painkiller? <\/strong><\/p><p>Those who smoke cigarette always do it with a certain swag; a kind of complacency and sense of wholeness that makes the act appear quite enjoyable. But that was not the case with this poor chap in front me. He seemed to be into this to whisk away his pain. His was a suicidal smoking!<\/p><p>So I thought to myself, &ldquo;Perhaps this dude lost a job or looked for one and failed to secure any. Then in his missions to hustle his way through the city, he got run over by a train, maybe, or some machine as monstrous as a train and had one of his legs amputated.&rdquo;<\/p><p>&ldquo;Then perhaps his wife or girlfriend left him because he was almost functionally useless. He must have gotten a wrong woman, so she ran away to find herself a greener pasture. This man was then left lonely and sad, perhaps. It&apos;s likely in this spirit of resentment and bitterness that the chap then plunged himself into begging and heavy smoking.&rdquo;<\/p><p>This man must have failed to find the faint lines of positivity in the life. Maybe he thought that life taxed him too much and lost the sense of belonging to himself. He then must have sold his heart away!<\/p><p>The man seemed to not understand why the people he begged could not see his situation and sympathize with him. So he was in a mission to destroy his body, smoking away every coin that he got in the streets. His life was depleting, yet he didn&apos;t care much.<\/p><p><strong>Do<\/strong>n&apos;t Qu<strong>it<\/strong><\/p><p>Paradoxically, the very man wore a T-shirt with the inscription, <strong><em>Do<\/em><\/strong><em>n&apos;t Qu<strong>it<\/strong><\/em><strong>. <\/strong>Apparently, he only seemed to single out the &apos;Do it&apos; part of the slogan! Lost in negativity, the man just keeps <em>doing it<\/em>. And he is not quitting!<\/p><p>He represents many people out there, who keep getting <em>it <\/em>wrong.<\/p><p>There are many a people who have made costly decisions as a result of resentment and bitterness. It&apos;s quite true that sometimes life can put you on the edge of a precipice and roll you over for a fall. But there is no problem with falling, the problem is in staying on the ground.<\/p><p><strong>You can get up, dust yourself off and move on &ndash; with positivity<\/strong><\/p><p>If only the man looked at his situation differently, without apathy and bitterness, a lot could have been different. With the right attitude and mindset, even this man would be having a family, and busy building the nation. All is not always lost upon physical incapacitation, emotional breakdown, or even heartache. We can get bitter but we should never stay bitter. When you find yourself in a terrible situation, pick yourself up and dust yourself off &ndash; life will be whatever you make it.<\/p>","content_min":"<p>The date is 6th September 2018, around 3pm. I&apos;m supposed to attend a meeting at Caf&eacute; Deli (Nairobi) but from the look of things, it&apos;s going to take a while before this meeting kicks off. So I install myself on one of those public benches in town just to ponder.<\/p><p>It&apos;s th","author":"@leonardondigo","usr_id":"140","author_clean":"leonardondigo","author_name":"Leonard Ondigo","author_img":"http:\/\/[::1]\/talk_new\/uploads\/profile\/a5e083ae0a10334ca476a6bd52f16f30.jpg","type":"normal","published":"1536587686","date":"10-09-2018"}},"formatted":306,"position":"#14"},{"id":"80d8f32cdf671755a174b86deff6ce3fdcd5326e","count":268,"details":{"status":true,"published":true,"likes":2,"views":268,"comments":0,"article_fb":"http:\/\/www.facebook.com\/sharer.php?u=http:\/\/[::1]\/talk_new\/article\/what-if-you-lost-everything-and-had-to-start-from-zero~9b73c?p='fb'","article_twitter":"http:\/\/twitter.com\/intent\/tweet?url=http:\/\/[::1]\/talk_new\/article\/what-if-you-lost-everything-and-had-to-start-from-zero~9b73c?p='twitter'&text=What If You Lost Everything and Had to Start from Zero?","article_linked":"https:\/\/www.linkedin.com\/cws\/share?url=http:\/\/[::1]\/talk_new\/article\/what-if-you-lost-everything-and-had-to-start-from-zero~9b73c?p='linked'&text=What If You Lost Everything and Had to Start from Zero?","owner":false,"user_following":true,"user_liked":true,"isOnline":true,"details":{"identifier":"80d8f32cdf671755a174b86deff6ce3fdcd5326e","column":"Inspiration","url":"http:\/\/[::1]\/talk_new\/article\/what-if-you-lost-everything-and-had-to-start-from-zero~9b73c","title":"What If You Lost Everything and Had to Start from Zero?","attachment":{"type":"image","meta":"","src":"http:\/\/[::1]\/talk_new\/uploads\/posts\/48e418e3d2a9d1cc422ce85d35ad4c66.JPG"},"content":"<p>We are all chasing after one thing in this life. Success. Money. Fancy life. We engage in a tiring plethora of activities just to have some comfort in life. &nbsp;Some have succeeded in that. Some are still caught up in the struggle. Others, yet, have their heads buried in calculations trying to figure out where to begin from. &nbsp;&nbsp;<\/p><p>What happens when success begins to respond to our efforts? Most people tend dip their heads in their achievements so much so that they think about nothing else.<\/p><p>Success is precious. It finally gives you the ability to lead the life of your dreams; dress as you want, drive your dream car. Having all the money means you can now do <em>anything<\/em> you want. And right there, at the top, you can get quite complacent &ndash; thinking only about how to keep the money flowing. But have you ever stopped to ask:<\/p><p><strong>What if I lost everything and had to start from scratch?<\/strong><\/p><p>Legendary marketer Russell Brunson&nbsp;some time back sent a brief email to his &apos;Two Comma Club&apos; award winners. Inside the email was one question. &nbsp;It read:<\/p><p>Losing everything<\/p><p>&ldquo;You suddenly lose EVERYTHING in your business (Your money, your big name, your list, your affiliates and partners, all of it!) ... You have bills piled high, school fees staring at you, people harassing you for money over the phone...Other than your vast marketing experience, you&apos;re back to being a NEWBIE...What EXACTLY would you do...to SAVE yourself?&rdquo;<\/p><p>You are a successful entrepreneur, money has started or is already flowing. You look at where you have come from, the past struggles, fears, hurdles, setbacks...and sheepishly smile at them. You are headed to the top. Self-actualization.&nbsp;<\/p><p>Then, as though all of a sudden, all that is gone! What would you do to provide for yourself, your family...what would you do, really?<\/p><p><strong>Starting from zero<\/strong><\/p><p>Nick Hornby admits that it&apos;s hard trying to rebuild yourself, piece by piece, with no guidebook to refer to and no clue as to where all the important bits went to. With no company to your name, no job, no roof over your head. All you have got is charred remains of what used to be a fortune. Deep within you, you know you should be able to figure it out but you have no clue what figuring out is supposed to look like.<\/p><p>In one of his quotes, Aberjhni says that a bridge of silver wings stretches from the dead ashes of an unforgiving nightmare of a jeweled life started a new. To mean there is plenty where the other(s) had come from. You just need to stop brooding over the spilt milk. Instead, stand to your feet and proclaim that you can do it. If you did it once, you can definitely do it again.<\/p><p>For the newbies, if you can imagine it, you can do it. The law of attraction states that you attract to yourself what you proclaim. The universe faithfully duplicates or mirrors your thoughts and emotions then brings them to you in form of physical reality.<\/p><p>That&apos;s how life is: unpredictable. And without some form of universal general insurance to always fall back to, you have to prepare for <em>life<\/em>. Whatever fortune you own now might come tumbling down within seconds. Make plans, draw your board, and have a diversified mind. Contemplate the unforeseen possibilities &ndash; then prepare for them.<\/p><p>Now tell me, what if you lost&nbsp;everything today and had to begin from scratch?<\/p>","content_min":"<p>We are all chasing after one thing in this life. Success. Money. Fancy life. We engage in a tiring plethora of activities just to have some comfort in life. &nbsp;Some have succeeded in that. Some are still caught up in the struggle. Others, yet, have their heads buried in calculations trying to ","author":"@angelyneobonyo","usr_id":"149","author_clean":"angelyneobonyo","author_name":"Angelyne Obonyo","author_img":"http:\/\/[::1]\/talk_new\/uploads\/profile\/21f8615cdbfd5889f3075cc632866166.jpg","type":"normal","published":"1537507288","date":"21-09-2018"}},"formatted":268,"position":"#15"}]}